; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	instrument6 - instrument
	instrument7 - instrument
	infrared3 - mode
	thermograph7 - mode
	infrared4 - mode
	image2 - mode
	thermograph6 - mode
	spectrograph1 - mode
	infrared5 - mode
	infrared0 - mode
	Star4 - direction
	GroundStation2 - direction
	Star3 - direction
	Star0 - direction
	Star1 - direction
	Star5 - direction
	Star6 - direction
	Planet7 - direction
	Planet8 - direction
	Star9 - direction
)
(:init
	(supports instrument0 infrared5)
	(supports instrument0 infrared4)
	(calibration_target instrument0 GroundStation2)
	(supports instrument1 infrared4)
	(calibration_target instrument1 GroundStation2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet7)
	(supports instrument2 infrared4)
	(supports instrument2 image2)
	(supports instrument2 thermograph6)
	(calibration_target instrument2 Star1)
	(supports instrument3 infrared0)
	(supports instrument3 thermograph7)
	(supports instrument3 spectrograph1)
	(calibration_target instrument3 Star0)
	(supports instrument4 infrared5)
	(calibration_target instrument4 Star3)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet8)
	(supports instrument5 infrared3)
	(supports instrument5 thermograph7)
	(supports instrument5 thermograph6)
	(calibration_target instrument5 Star0)
	(supports instrument6 image2)
	(calibration_target instrument6 Star0)
	(supports instrument7 infrared0)
	(calibration_target instrument7 Star1)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation2)
)
(:goal (and
	(pointing satellite0 Star9)
	(pointing satellite1 Planet8)
	(pointing satellite2 Star5)
	(have_image Star5 infrared0)
	(have_image Star6 spectrograph1)
	(have_image Star6 thermograph6)
	(have_image Planet7 infrared4)
	(have_image Planet7 spectrograph1)
	(have_image Planet8 image2)
	(have_image Star9 thermograph6)
))

)

; plan
1. (turn_to satellite1 star0 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 star0)
   goals met: 0 of 10
2. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 10
3. (calibrate satellite1 instrument3 star0)
   added: (calibrated instrument3)
   goals met: 0 of 10
4. (turn_to satellite1 star6 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 star6)
   goals met: 0 of 10
5. (take_image satellite1 star6 instrument3 spectrograph1)
   added: (have_image star6 spectrograph1)
   goals met: 1 of 10
6. (turn_to satellite1 star5 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 star5)
   goals met: 1 of 10
7. (take_image satellite1 star5 instrument3 infrared0)
   added: (have_image star5 infrared0)
   goals met: 2 of 10
8. (turn_to satellite1 planet7 star5)
   deleted: (pointing satellite1 star5)
   added: (pointing satellite1 planet7)
   goals met: 2 of 10
9. (turn_to satellite0 star9 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 star9)
   goals met: 3 of 10
10. (take_image satellite1 planet7 instrument3 spectrograph1)
   added: (have_image planet7 spectrograph1)
   goals met: 4 of 10
11. (switch_off instrument3 satellite1)
   deleted: (power_on instrument3)
   added: (power_avail satellite1)
   goals met: 4 of 10
12. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 4 of 10
13. (turn_to satellite1 star1 planet7)
   deleted: (pointing satellite1 planet7)
   added: (pointing satellite1 star1)
   goals met: 4 of 10
14. (calibrate satellite1 instrument2 star1)
   added: (calibrated instrument2)
   goals met: 4 of 10
15. (turn_to satellite1 planet7 star1)
   deleted: (pointing satellite1 star1)
   added: (pointing satellite1 planet7)
   goals met: 4 of 10
16. (take_image satellite1 planet7 instrument2 infrared4)
   added: (have_image planet7 infrared4)
   goals met: 5 of 10
17. (turn_to satellite1 star6 planet7)
   deleted: (pointing satellite1 planet7)
   added: (pointing satellite1 star6)
   goals met: 5 of 10
18. (take_image satellite1 star6 instrument2 thermograph6)
   added: (have_image star6 thermograph6)
   goals met: 6 of 10
19. (turn_to satellite1 star9 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 star9)
   goals met: 6 of 10
20. (take_image satellite1 star9 instrument2 thermograph6)
   added: (have_image star9 thermograph6)
   goals met: 7 of 10
21. (turn_to satellite1 planet8 star9)
   deleted: (pointing satellite1 star9)
   added: (pointing satellite1 planet8)
   goals met: 8 of 10
22. (take_image satellite1 planet8 instrument2 image2)
   added: (have_image planet8 image2)
   goals met: 9 of 10
23. (turn_to satellite2 star5 groundstation2)
   deleted: (pointing satellite2 groundstation2)
   added: (pointing satellite2 star5)
   goals met: 10 of 10
